In [1]:
import numpy  as np
import pandas as pd

# **Sélectionner les données d'un dataframe**

In [2]:
notes_français = pd.Series({"Christophe": 0,  "Carla": 5, "Caroine": 20, "Jean-Baptiste": 12, "Florence": 19,   "Emma": 19})
notes_histoire = pd.Series({"Christophe": 0,  "Carla": 9, "Caroine": 20, "Jean-Baptiste": 18, "Florence": 20,   "Emma": 19})
notes_maths    = pd.Series({"Christophe": 17, "Carla": 6, "Caroine": 20, "Jean-Baptiste": 2,  "Florence": 15.5, "Emma": 19})
notes          = pd.DataFrame({'Français':notes_français,'Histoire':notes_histoire,'Maths':notes_maths})
notes

               Français  Histoire  Maths
Christophe            0         0   17.0
Carla                 5         9    6.0
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [3]:
# Sélection classique
notes['Maths']

Christophe       17.0
Carla             6.0
Caroine          20.0
Jean-Baptiste     2.0
Florence         15.5
Emma             19.0
Name: Maths, dtype: float64

In [4]:
# Autre manière
notes.Maths

Christophe       17.0
Carla             6.0
Caroine          20.0
Jean-Baptiste     2.0
Florence         15.5
Emma             19.0
Name: Maths, dtype: float64

In [5]:
notes.Maths is notes['Maths']

True

Les 2 manières ont un effet identique.

In [7]:
# Sélectionner plusieurs colonnes par une liste de liste
notes[['Histoire','Français']]

               Histoire  Français
Christophe            0         0
Carla                 9         5
Caroine              20        20
Jean-Baptiste        18        12
Florence             20        19
Emma                 19        19

IL n'y qu'une façon de séléctionenr plusieurs colonnes

#### _Pour sélectionner les lignes il y a 2 méthodes_

In [12]:
# Sélectionner avec la méthode loc() qui récupère les étiquettes
notes.loc['Emma']

Français    19.0
Histoire    19.0
Maths       19.0
Name: Emma, dtype: float64

In [13]:
# Sélectionner par l'indice
notes.iloc[3]

Français    12.0
Histoire    18.0
Maths        2.0
Name: Jean-Baptiste, dtype: float64

In [14]:
# Plusieurs linges
notes.iloc[[2,3,4,5]]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [16]:
# Plusieurs avec loc
notes.loc[notes.index[-4:]]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [17]:
# Sélection par une liste de noms d'index
notes.loc[["Carla", "Emma"]]

       Français  Histoire  Maths
Carla         5         9    6.0
Emma         19        19   19.0

In [19]:
# Sélection par une tranche (slice) de noms d'index
notes.loc["Carla":"Florence"] # Florence est incluse

               Français  Histoire  Maths
Carla                 5         9    6.0
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5

In [20]:
# Sélectionne les 3 premières lignes
notes.loc[notes.index[:3]]

            Français  Histoire  Maths
Christophe         0         0   17.0
Carla              5         9    6.0
Caroine           20        20   20.0

In [21]:
# Sélection par une condition booléenne
notes.loc[notes["Histoire"] > 15]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [ ]:
# Sélection par une fonction ou une méthode sur l'index (de type string)
notes.loc[notes.index.str.startswith("C")]

In [22]:
# Sélection par un masque booléen personnalisé
mask = (notes["Français"] > 10) & (notes["Histoire"] > 15)
notes.loc[mask]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [24]:
# Sélection par un ensemble d'index (set)
notes.loc[["Christophe","Emma"]]

            Français  Histoire  Maths
Christophe         0         0   17.0
Emma              19        19   19.0

In [25]:
# Sélection par un filtre sur l'index
notes.loc[notes.index.isin(["Carla", "Florence", "Emma"])]

          Français  Histoire  Maths
Carla            5         9    6.0
Florence        19        20   15.5
Emma            19        19   19.0

In [27]:
notes['Moyenne'] = ((notes['Français'] + notes['Histoire'] + notes['Maths']) / 3).round().astype(int)
notes

               Français  Histoire  Maths  Moyenne
Christophe            0         0   17.0        6
Carla                 5         9    6.0        7
Caroine              20        20   20.0       20
Jean-Baptiste        12        18    2.0       11
Florence             19        20   15.5       18
Emma                 19        19   19.0       19

In [28]:
# La moyenne de Florence
notes.loc['Florence','Moyenne']

np.int64(18)

In [ ]:
# Les notes de français et d'histoire d'Emma et Florence
notes.loc[['Emma','Florence'],['Français','Histoire']]